Revit 2027 API
RebarSpliceGeometry.SpliceOrigin Property
 Identifies the splice face origin.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ SpliceOrigin { get; set; }
Public Property SpliceOrigin As XYZ
	Get
	Set
public:
property XYZ^ SpliceOrigin {
	XYZ^ get ();
	void set (XYZ^ value);
}
member SpliceOrigin : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
RebarSpliceGeometry Class
Autodesk.Revit.DB.Structure Namespace